#6.	Дано число обозначающее день недели. 
# Вывести его название и указать является ли он выходным.

a =int(input( 'Введите  число от 1 до 7 соответствующего дня недели    '   ))
   
if a==1:
 print('понедельник тяжелый рабочий день')
if a==2:
 print('вторник рабочий день надо работать')
if a==3:
 print('среда еще рабочий день')
if a==4:
 print('четверг короткий рабочий день')
if a==5:
 print('пятница развратница')
if a==6:
 print('суббота ура выходной')
if a==7:
 print('воскресенье выходной ')

  
